import InfoPopup from "../InfoPopup";

const headersInfo = {
  'תפקיד חדש': `פתיחת תפקיד חדש תחת היררכיה נבחרת:
  בחירת היררכיה לתפקיד
  ▼
  הכנסת שם לתפקיד החדש
  ▼
  בחירת סיווג תפקיד
  ▼
  בחירת גורם מאשר מיחידתך לאישור הבקשה 🤓`,
  'תפקידים חדשים': `פתיחת מסת תפקידים תחת היררכיה נבחרת:
  הורדת פורמט הבקשה ומילוי בהתאם להסבר
  ▼
  בחירת היררכיה לתפקידים
  ▼
  העלאת הקובץ המלא ובחירת גורם מאשר מיחידתך לאישור הבקשה 😎`,
  'מעבר היררכיה לתפקיד': `העברת תפקיד נבחר להיררכיה ארגונית אחרת:
  בחירת ההיררכיה בה נמצא התפקיד להעברה
  ▼
  בחירת התפקיד מרשימת התפקידים (ניתן להכניס מזהה תפקיד להשלמה אוטומטית של הערכים)
  ▼
  בחירת ההיררכיה החדשה להעברת התפקיד
  ▼
  בחירת גורם מאשר מיחידתך לאישור הבקשה 🤓`,
  'הגשת בקשה מרובה': `מעבר היררכיה למס' תפקידים:
  הורדת פורמט הבקשה ומילוי בהתאם להסבר
  ▼
  בחירת ההיררכיה הנוכחית בה נמצאים התפקידים
  ▼
  בחירת ההיררכיה החדשה אליה יעברו התפקידים
  ▼
  העלאת הקובץ המלא ובחירת גורם מאשר מיחידתך לאישור הבקשה 😎
  `,
  'חיבור משתמש חדש לתפקיד': `חיבור בין חייל חדש לתפקיד קיים במערכת:
  הכנסת פרטי המשתמש עבורו מחברים תפקיד
  ▼
  בחירת ההיררכיה בה נמצא התפקיד הרצוי
  ▼
  בחירת התפקיד מרשימת התפקידים (ניתן להכניס מזהה תפקיד להשלמה אוטומטית של הערכים)
  ▼
  בחירת גורם מאשר מיחידתך לאישור הבקשה 🤓`,
  'יצירת משתמש מיוחד': `יצירת אזרח/יועץ והכנסתו למערכת הארגונית:
  הכנסת פרטיו האישיים של המשתמש ויצירתו
  ▼
  לאחר מכן, ניתן לחבר בין המשתמש לתפקיד קיים`,
};

const renderAccordionTabHeader = (title, showInfo) => {
  return (
    <div className="display-flex">
      {title}
      <InfoPopup
        name={title + " accordion"}
        infoText={headersInfo[title]}
        visible={showInfo}
      ></InfoPopup>
    </div>
  );
};

export default renderAccordionTabHeader;
