import "primeicons/primeicons.css";

const faqs = [
  {
    header: "ברוכים הבאים למערכת LEGO! 🥳",
    icon: "pi pi-star-o",
    body: `LEGO מאפשרת לך לנהל את הזהות שלך באופן עצמאי ולהגיש בקשות לבד ליצירה/ עדכון של זהותך.
    אז מה אפשר לעשות במערכת? 👩🏻‍💻
    לפתוח תפקיד חדש בהיררכיה הרצויה , להעביר תפקיד בין היררכיות, לעבור תפקיד כשמתקדמים לתפקיד הבא, לחבר בין משתמש חדש באמ"ן לתפקיד קיים, ליצור משתמש לאזרח, לפתוח היררכיה חדשה ולבקש הרשאות מסוימות לפעולות במערכת (לפי הצורך כן? :) ) וכמובן לערוך את שם התפקיד שלך.
    
    בלשוניות הבאות יהיו הסברים על שאלות נפוצות שיכולות לעלות בזמן שימוש במערכת.
    מוזמנים להציע רעיונות להסברים נוספים דרך "צור קשר" !
    השאלות מנוסחות בלשון זכר אך פונות לשני המינים :)`,
  },
  {
    header: "למה אני צריך להשתמש במערכת LEGO?",
    icon: "pi pi-question-circle",
    body: `מערכת LEGO פותחה כדי שנוכל להגיש בקשות באופן עצמאי הקשורות לזהות האמנית שלנו (שם התפקיד שלנו, מעבר תפקיד ובקשות נוספות) ללא תלות במוקד תמיכה. 
    כל בקשה עוברת סבב אישורים בהתאם למהות הבקשה טרם ביצועה.`,
  },
  {
    header: "מה הכוונה בבחירת היררכיה בכל הבקשות?",
    icon: "pi pi-question-circle",
    body: `בחירת היררכיה משמשת במרבית הבקשות כמקום שבו הבקשה תיווצר או כדי לקבל פרטים על נתונים שנמצאים באותה ההיררכיה הנבחרת. "היררכיה" משמעותה יחידת ארגונית (יחידה, ענף, מדור, צוות וכו').`,
  },
  {
    header: 'מה זה "גורם מאשר" ביחידה?',
    icon: "pi pi-question-circle",
    body: `"גורם מאשר" הינו רס"ן ומעלה או משתמש שהוחרג לכך שתפקידו לאשר באופן ראשוני את הבקשות שלנו. בכל בקשה שמוגשת, יש לבחור את הגורם המאשר ביחידתך כדי שיוכל לאשר את את המשך הטיפול בבקשה באופן המהיר והיעיל ביותר. ניתן לבחור יותר מגורם מאשר אחד לכל בקשה.`,
  },
  {
    header: "מה זה מזהה תפקיד (T)?",
    icon: "pi pi-question-circle",
    body: `במספר בקשות קיימת האופציה להכניס את מזהה התפקיד (T) עבור מציאת התפקיד הרלוונטי כדרך "קצרה" יותר לאתר את התפקיד במקום לחפש אותו בהיררכיה.
    מזהה התפקיד זה הערך הספציפי, החד ערכי, שניתן לתפקיד לאחר שנפתח. ניתן למצוא את מזהה התפקיד של תפקיד מסויים דרך טבלת התפקידים או דרך האאוטלוק בכתובת התפקיד (ctrl+k כשמחפשים). הT בד"כ מכיל מס' קבוע של מספרים אחריו לדוגמת T0123456.`,
  },
  {
    header: "מה אני עושה אם התפקיד שאליו אני רוצה לעבור עדין תפוס?",
    icon: "pi pi-question-circle",
    body: `במידה ואתה מתקדם לתפקיד הבא, והתפקיד עדין תפוס ע"י מבצע התפקיד הנוכחי עליך לקבוע איתו מראש את המועד שבו "תתפוס" לו את היוזר. אחרי שקבעתם את המועד, בעת הגשת הבקשה למעבר תפקיד עליך למלא את התאריך והשעה  שקבעתם להחלפה, לבחור גורם מאשר מיחידתך שיאשר את ההחלפה.`,
  },
];

export default faqs;
